function getCaseMap(id) {
    var map = {
        '1': {'type': '普通检索', 'option': '键入“合同”+点击“检索Alpha案例库”/Enter', 'errorMsg': '显示其他标签或无标签列表结果数量A少于前一次脚本测试的结果数量'},
        '2': {'type': '普通检索', 'option': '键入“返还”+Enter', 'errorMsg': '不执行搜索显示其他标签或无标签列表结果数量B少于前一次脚本测试的结果数量新列表结果数量B不少于原列表结果数量A'},
        '3': {'type': '普通检索', 'option': '键入“合同 纠纷”+点击“检索Alpha案例库”/Enter', 'errorMsg': '显示其他标签或无标签列表结果数量C少于前一次脚本测试的结果数量'},
        '4': {'type': '在结果中搜索', 'option': '（在前一个测试用例的环境下）键入“返还”+Enter', 'errorMsg': '不执行搜索显示其他标签或无标签列表结果数量D少于前一次脚本测试的结果数量新列表结果数量D不少于原列表结果数量C'},
        '5': {'type': '普通检索', 'option': '键入“-合同”+点击“检索Alpha案例库”/Enter', 'errorMsg': '显示其他标签或无标签普通检索/高级检索全文+在结果中检索“合同”+Enter，结果列表数量不为0列表结果数量E少于前一次脚本测试的结果数量'},
        '6': {'type': '在结果中搜索', 'option': '（在前一个测试用例的环境下）键入“返还”+Enter', 'errorMsg': '不执行搜索显示其他标签或无标签列表结果数量F少于前一次脚本测试的结果数量新列表结果数量F不少于原列表结果数量E'},
        '7': {'type': '普通检索', 'option': '键入”合同 -借贷“+点击“检索Alpha案例库”/Enter', 'errorMsg': '显示其他标签或无标签普通检索/高级检索全文+在结果中检索“借贷”+Enter，结果列表数量为0列表结果数量G少于前一次脚本测试的结果数'},
        '8': {'type': '高级检索', 'option': '全文键入“合同”+点击“检索Alpha案例库”', 'errorMsg': '显示其他标签或无标签列表结果数量I少于前一次测试的结果数量,'},
        '9': {'type': '高级检索', 'option': '全文键入“合同 纠纷”+点击“检索Alpha案例库””', 'errorMsg': '一个标签“合同 纠纷”列表结果数量K少于前一次测试的结果数量,'},
        '10': {'type': '高级搜索', 'option': '全文键入“-合同”+点击“检索Alpha案例库”', 'errorMsg': '显示其他标签或无标签普通检索/高级检索全文+在结果中检索“合同”+Enter，结果列表数量不为0列表结果数量M不少于前一次测试的结果数量M≠E'},
        '11': {'type': '高级搜索', 'option': '全文键入“合同 -借贷”+点击“检索Alpha案例库”', 'errorMsg': '显示其他标签或无标签普通检索/高级检索全文+在结果中检索“借贷”+Enter，结果列表数量不为0列表结果数量O少于前一次测试的结果数量O≠G'},
        '12': {'type': '高级检索', 'option': '案由键入“投资”直接搜索', 'errorMsg': '未suggestsuggest其他字段'},
        '13': {'type': '高级检索', 'option': '案由键入键入“投资”选择案由搜索', 'errorMsg': '未suggestsuggest其他字段或者参数错误'},
        '14': {'type': '高级检索', 'option': '当事人键入键入“投资”选择案由搜索', 'errorMsg': '未suggestsuggest其他字段或者参数错误'},
        '15': {'type': '高级检索', 'option': '律师键入“张”', 'errorMsg': '未suggestsuggest其他字段或者参数错误'},
        '16': {'type': '高级检索', 'option': '律师事务所键入“金杜”', 'errorMsg': '律师事务所键入“金杜”未suggestsuggest其他字段或者参数错误'},
        '17': {'type': '高级检索', 'option': '法官键入“张”', 'errorMsg': '法官键入“张”未suggestsuggest其他字段或者参数错误'},
        '18': {'type': '高级检索', 'option': '法院键入“中级”', 'errorMsg': '法官键入“张”未suggestsuggest其他字段或者参数错误'},
        '19': {'type': '高级检索', 'option': '引用法条键入“合同”', 'errorMsg': '法官键入“张”未suggestsuggest其他字段或者参数错误'},
        //法规
        '20': {'type': '简单检索', 'option': '键入“物权”+点击“检索Alpha法规库”/Enter', 'errorMsg': '未suggest“快速前往”或suggest其他一个标签“物权”列表结果数量A少于前一次脚本测试的结果数量'},
        '21': {'type': '简单检索', 'option': '（在前一个测试用例的环境下）键入“诉讼”+Enter', 'errorMsg': 'suggest“快速前往”显示其他标签或不显示标签新列表结果数量B不少于原列表结果数量A'},
        '22': {'type': '简单检索', 'option': '键入“法 关于”+点击“检索Alpha法规库”/Enter', 'errorMsg': '未suggest“快速前往”或suggest其他一个标签“法 关于”列表结果数量C少于前一次脚本测试的结果数量'},
        '23': {'type': '简单检索', 'option': '（在前一个测试用例的环境下）键入“诉讼”+Enter', 'errorMsg': 'suggest“快速前往”显示其他标签或不显示标签新列表结果数量D不少于原列表结果数量C'},
        '24': {'type': '简单检索', 'option': '键入“-物权”+点击“检索Alpha法规库”/Enter', 'errorMsg': '未suggest“快速前往”或suggest其他显示其他标签或无标签列表结果数量E少于前一次脚本测试的结果数量普通检索/高级检索全文“物权”+在结果中检索+Enter，结果列表数量不为0'},
        '25': {'type': '简单检索', 'option': '（在前一个测试用例的环境下键入“诉讼”+Enter', 'errorMsg': '未suggest“快速前往”或suggest其他显示其他标签或无标签列表结果数量E少于前一次脚本测试的结果数量普通检索/高级检索全文“物权”+在结果中检索+Enter，结果列表数量不为0'},
        '26': {'type': '简单检索', 'option': '键入“法 -物权”+点击“检索Alpha法规库”/Enter', 'errorMsg': '未suggest“快速前往”或suggest其他显示其他标签或无标签列表结果数量G少于前一次脚本测试的结果数量'},
        '27': {'type': '在结果中搜索', 'option': '（在前一个测试用例的环境下）键入“诉讼”+Enter', 'errorMsg': '未suggest“快速前往”或suggest其他显示其他标签或无标签新列表结果数H不少于原列表结果数G'},
        //法规高级检索
        '28': {'type': '高级检索', 'option': '全文键入“法 关于”+点击“检索Alpha法规库”', 'errorMsg': '显示其他标签或无标签列表结果数量K不少于原列表结果数量K≠C'},
        '29': {'type': '在结果中搜索', 'option': '（在前一个测试用例的环境下）键入“诉讼”+Enter', 'errorMsg': '未suggest或suggest其他列表结果数量L不少于原列表结果数量L≠D'},
        '30': {'type': '高级检索', 'option': '全文键入”-物权“+点击“检索Alpha法规库”', 'errorMsg': '显示其他标签或无标签列表结果数量M少于前一次脚本测试的结果数量M≠E'},
        '31': {'type': '高级检索', 'option': '（在前一个测试用例的环境下）键入“诉讼”+Enter', 'errorMsg': '显示其他标签或无标签列表结果数量M少于前一次脚本测试的结果数量M≠E'},
        '32': {'type': '高级检索', 'option': '全文键入“法 -物权”+点击“检索Alpha法规库”', 'errorMsg': '显示其他标签或无标签列表结果数量O少于前一次脚本测试的结果数量O≠G'},
        '33': {'type': '高级检索', 'option': '（在前一个测试用例的环境下）键入“诉讼”+点击“检索Alpha法规库”', 'errorMsg': '显示其他标签或无标签新列表结果数量P不少于原列表结果数量OP≠H'},
        '34': {'type': '高级检索', 'option': '发文机关键入“河北省”选择suggest，效力级别选择“法律”、“行政法规”、“军事法规”', 'errorMsg': '显示其他标签或无标签新列表结果数量P不少于原列表结果数量OP≠H'},
        '35': {'type': '高级检索', 'option': '结果列表数量不为0#有可能当天的法规及时采集入库，所以这里的不一定真的出错，需要手工核验。'},
        '36': {'type': '高级检索', 'option': '全文（满足以下任一条件）键入“合同”、“认为”、“诉称”、“辩称”、“-死刑”；标题（满足以下任一条件）键入“纠纷”、“民事”、“审”；案号键入“民”；案由（满足以下任一条件）键入“民间借贷纠纷”、“企业借贷纠纷”、“合同纠纷”；当事人（满足以下任一条件）键入“公司”、“企业”、“张”；代理律师（满足以下任一条件）键入“张”、“周”、“吴”；律所键入“事务所”法院键入“中级”、裁判时间“2008年1月1日至今天”标的额“10万-10000万”、法院观点键入“借条”、裁判结果键入“偿还”、法条引用键入“合同法”并选择suggest“中华人民共和国合同法|现行有效” +点击“检索Alpha案例库”'}


    }
    return map[id]

}
module.exports = getCaseMap